{
  "_name_or_path": "google/vit-base-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Calling",
    "1": "Clapping",
    "2": "Cycling",
    "3": "Dancing",
    "4": "Drinking",
    "5": "Eating",
    "6": "Fighting",
    "7": "Hugging",
    "8": "Laughing",
    "9": "Listening Music",
    "10": "Running",
    "11": "Sitting",
    "12": "Sleeping",
    "13": "Texting",
    "14": "Using Laptop"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Calling": 0,
    "Clapping": 1,
    "Cycling": 2,
    "Dancing": 3,
    "Drinking": 4,
    "Eating": 5,
    "Fighting": 6,
    "Hugging": 7,
    "Laughing": 8,
    "Listening Music": 9,
    "Running": 10,
    "Sitting": 11,
    "Sleeping": 12,
    "Texting": 13,
    "Using Laptop": 14
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.35.2"
}
